Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ2064DAH169.atdf
      <value-group caption="System PLL Input Clock Select bit" name="DEVCFG2__FPLLICLK">
         <value caption="FRC is input to the System PLL" name="PLL_FRC" value="0x1" />
         <value caption="POSC is input to the System PLL" name="PLL_POSC" value="0x0" />
      </value-group>
      <value-group caption="System PLL Feedback Divider bits" name="DEVCFG2__FPLLMULT">
         <value caption="PLL Multiply by 1" name="MUL_1" value="0x0" />
         <value caption="PLL Multiply by 2" name="MUL_2" value="0x1" />
         <value caption="PLL Multiply by 3" name="MUL_3" value="0x2" />
         <value caption="PLL Multiply by 4" name="MUL_4" value="0x3" />
         <value caption="PLL Multiply by 5" name="MUL_5" value="0x4" />
         <value caption="PLL Multiply by 6" name="MUL_6" value="0x5" />
         <value caption="PLL Multiply by 7" name="MUL_7" value="0x6" />
         <value caption="PLL Multiply by 8" name="MUL_8" value="0x7" />
         <value caption="PLL Multiply by 9" name="MUL_9" value="0x8" />
         <value caption="PLL Multiply by 10" name="MUL_10" value="0x9" />
         <value caption="PLL Multiply by 11" name="MUL_11" value="0xa" />
         <value caption="PLL Multiply by 12" name="MUL_12" value="0xb" />
         <value caption="PLL Multiply by 13" name="MUL_13" value="0xc" />
         <value caption="PLL Multiply by 14" name="MUL_14" value="0xd" />
         <value caption="PLL Multiply by 15" name="MUL_15" value="0xe" />
         <value caption="PLL Multiply by 16" name="MUL_16" value="0xf" />
         <value caption="PLL Multiply by 17" name="MUL_17" value="0x10" />
         <value caption="PLL Multiply by 18" name="MUL_18" value="0x11" />
         <value caption="PLL Multiply by 19" name="MUL_19" value="0x12" />
         <value caption="PLL Multiply by 20" name="MUL_20" value="0x13" />
         <value caption="PLL Multiply by 21" name="MUL_21" value="0x14" />
         <value caption="PLL Multiply by 22" name="MUL_22" value="0x15" />
         <value caption="PLL Multiply by 23" name="MUL_23" value="0x16" />
         <value caption="PLL Multiply by 24" name="MUL_24" value="0x17" />
         <value caption="PLL Multiply by 25" name="MUL_25" value="0x18" />
         <value caption="PLL Multiply by 26" name="MUL_26" value="0x19" />
         <value caption="PLL Multiply by 27" name="MUL_27" value="0x1a" />
         <value caption="PLL Multiply by 28" name="MUL_28" value="0x1b" />
         <value caption="PLL Multiply by 29" name="MUL_29" value="0x1c" />
         <value caption="PLL Multiply by 30" name="MUL_30" value="0x1d" />
         <value caption="PLL Multiply by 31" name="MUL_31" value="0x1e" />
         <value caption="PLL Multiply by 32" name="MUL_32" value="0x1f" />
         <value caption="PLL Multiply by 33" name="MUL_33" value="0x20" />
         <value caption="PLL Multiply by 34" name="MUL_34" value="0x21" />
         <value caption="PLL Multiply by 35" name="MUL_35" value="0x22" />
         <value caption="PLL Multiply by 36" name="MUL_36" value="0x23" />
         <value caption="PLL Multiply by 37" name="MUL_37" value="0x24" />
         <value caption="PLL Multiply by 38" name="MUL_38" value="0x25" />
         <value caption="PLL Multiply by 39" name="MUL_39" value="0x26" />
         <value caption="PLL Multiply by 40" name="MUL_40" value="0x27" />
         <value caption="PLL Multiply by 41" name="MUL_41" value="0x28" />
         <value caption="PLL Multiply by 42" name="MUL_42" value="0x29" />
         <value caption="PLL Multiply by 43" name="MUL_43" value="0x2a" />
         <value caption="PLL Multiply by 44" name="MUL_44" value="0x2b" />
         <value caption="PLL Multiply by 45" name="MUL_45" value="0x2c" />
         <value caption="PLL Multiply by 46" name="MUL_46" value="0x2d" />
         <value caption="PLL Multiply by 47" name="MUL_47" value="0x2e" />
         <value caption="PLL Multiply by 48" name="MUL_48" value="0x2f" />
         <value caption="PLL Multiply by 49" name="MUL_49" value="0x30" />
         <value caption="PLL Multiply by 50" name="MUL_50" value="0x31" />
         <value caption="PLL Multiply by 51" name="MUL_51" value="0x32" />
         <value caption="PLL Multiply by 52" name="MUL_52" value="0x33" />
         <value caption="PLL Multiply by 53" name="MUL_53" value="0x34" />
         <value caption="PLL Multiply by 54" name="MUL_54" value="0x35" />
         <value caption="PLL Multiply by 55" name="MUL_55" value="0x36" />
         <value caption="PLL Multiply by 56" name="MUL_56" value="0x37" />
         <value caption="PLL Multiply by 57" name="MUL_57" value="0x38" />
         <value caption="PLL Multiply by 58" name="MUL_58" value="0x39" />
         <value caption="PLL Multiply by 59" name="MUL_59" value="0x3a" />
         <value caption="PLL Multiply by 60" name="MUL_60" value="0x3b" />
         <value caption="PLL Multiply by 61" name="MUL_61" value="0x3c" />
         <value caption="PLL Multiply by 62" name="MUL_62" value="0x3d" />
         <value caption="PLL Multiply by 63" name="MUL_63" value="0x3e" />
         <value caption="PLL Multiply by 64" name="MUL_64" value="0x3f" />
         <value caption="PLL Multiply by 65" name="MUL_65" value="0x40" />
         <value caption="PLL Multiply by 66" name="MUL_66" value="0x41" />
         <value caption="PLL Multiply by 67" name="MUL_67" value="0x42" />
         <value caption="PLL Multiply by 68" name="MUL_68" value="0x43" />
         <value caption="PLL Multiply by 69" name="MUL_69" value="0x44" />
         <value caption="PLL Multiply by 70" name="MUL_70" value="0x45" />
         <value caption="PLL Multiply by 71" name="MUL_71" value="0x46" />
         <value caption="PLL Multiply by 72" name="MUL_72" value="0x47" />
         <value caption="PLL Multiply by 73" name="MUL_73" value="0x48" />
         <value caption="PLL Multiply by 74" name="MUL_74" value="0x49" />
         <value caption="PLL Multiply by 75" name="MUL_75" value="0x4a" />
         <value caption="PLL Multiply by 76" name="MUL_76" value="0x4b" />
         <value caption="PLL Multiply by 77" name="MUL_77" value="0x4c" />
         <value caption="PLL Multiply by 78" name="MUL_78" value="0x4d" />
         <value caption="PLL Multiply by 79" name="MUL_79" value="0x4e" />
         <value caption="PLL Multiply by 80" name="MUL_80" value="0x4f" />
         <value caption="PLL Multiply by 81" name="MUL_81" value="0x50" />
         <value caption="PLL Multiply by 82" name="MUL_82" value="0x51" />
         <value caption="PLL Multiply by 83" name="MUL_83" value="0x52" />
         <value caption="PLL Multiply by 84" name="MUL_84" value="0x53" />
         <value caption="PLL Multiply by 85" name="MUL_85" value="0x54" />
         <value caption="PLL Multiply by 86" name="MUL_86" value="0x55" />
         <value caption="PLL Multiply by 87" name="MUL_87" value="0x56" />
         <value caption="PLL Multiply by 88" name="MUL_88" value="0x57" />
         <value caption="PLL Multiply by 89" name="MUL_89" value="0x58" />
         <value caption="PLL Multiply by 90" name="MUL_90" value="0x59" />
         <value caption="PLL Multiply by 91" name="MUL_91" value="0x5a" />
         <value caption="PLL Multiply by 92" name="MUL_92" value="0x5b" />
         <value caption="PLL Multiply by 93" name="MUL_93" value="0x5c" />
         <value caption="PLL Multiply by 94" name="MUL_94" value="0x5d" />
         <value caption="PLL Multiply by 95" name="MUL_95" value="0x5e" />
         <value caption="PLL Multiply by 96" name="MUL_96" value="0x5f" />
         <value caption="PLL Multiply by 97" name="MUL_97" value="0x60" />
         <value caption="PLL Multiply by 98" name="MUL_98" value="0x61" />
         <value caption="PLL Multiply by 99" name="MUL_99" value="0x62" />
         <value caption="PLL Multiply by 100" name="MUL_100" value="0x63" />
         <value caption="PLL Multiply by 101" name="MUL_101" value="0x64" />
         <value caption="PLL Multiply by 102" name="MUL_102" value="0x65" />
         <value caption="PLL Multiply by 103" name="MUL_103" value="0x66" />
         <value caption="PLL Multiply by 104" name="MUL_104" value="0x67" />
         <value caption="PLL Multiply by 105" name="MUL_105" value="0x68" />
         <value caption="PLL Multiply by 106" name="MUL_106" value="0x69" />
         <value caption="PLL Multiply by 107" name="MUL_107" value="0x6a" />
         <value caption="PLL Multiply by 108" name="MUL_108" value="0x6b" />
         <value caption="PLL Multiply by 109" name="MUL_109" value="0x6c" />
         <value caption="PLL Multiply by 110" name="MUL_110" value="0x6d" />
         <value caption="PLL Multiply by 111" name="MUL_111" value="0x6e" />
         <value caption="PLL Multiply by 112" name="MUL_112" value="0x6f" />
         <value caption="PLL Multiply by 113" name="MUL_113" value="0x70" />
         <value caption="PLL Multiply by 114" name="MUL_114" value="0x71" />
         <value caption="PLL Multiply by 115" name="MUL_115" value="0x72" />
         <value caption="PLL Multiply by 116" name="MUL_116" value="0x73" />
         <value caption="PLL Multiply by 117" name="MUL_117" value="0x74" />
         <value caption="PLL Multiply by 118" name="MUL_118" value="0x75" />
         <value caption="PLL Multiply by 119" name="MUL_119" value="0x76" />
         <value caption="PLL Multiply by 120" name="MUL_120" value="0x77" />
         <value caption="PLL Multiply by 121" name="MUL_121" value="0x78" />
         <value caption="PLL Multiply by 122" name="MUL_122" value="0x79" />
         <value caption="PLL Multiply by 123" name="MUL_123" value="0x7a" />
         <value caption="PLL Multiply by 124" name="MUL_124" value="0x7b" />
         <value caption="PLL Multiply by 125" name="MUL_125" value="0x7c" />
         <value caption="PLL Multiply by 126" name="MUL_126" value="0x7d" />
         <value caption="PLL Multiply by 127" name="MUL_127" value="0x7e" />
         <value caption="PLL Multiply by 128" name="MUL_128" value="0x7f" />
      </value-group>
      <value-group caption="Default System PLL Output Divisor bits" name="DEVCFG2__FPLLODIV">
         <value caption="2x Divider" name="DIV_2" value="0x1" />
         <value caption="4x Divider" name="DIV_4" value="0x2" />
         <value caption="8x Divider" name="DIV_8" value="0x3" />
         <value caption="16x Divider" name="DIV_16" value="0x4" />
         <value caption="32x Divider" name="DIV_32" value="0x7" />
      </value-group>
      <value-group caption="VBAT BOR Enable bit" name="DEVCFG2__VBATBOREN">
         <value caption="Disable ZPBOR during VBAT Mode" name="OFF" value="0x0" />
         <value caption="Enable ZPBOR during VBAT Mode" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep BOR Enable bit" name="DEVCFG2__DSBOREN">
         <value caption="Disable ZPBOR during Deep Sleep Mode" name="OFF" value="0x0" />
         <value caption="Enable ZPBOR during Deep Sleep Mode" name="ON" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Postscale Select bits" name="DEVCFG2__DSWDTPS">
         <value caption="1:2^5" name="DSPS1" value="0x0" />
         <value caption="1:2^6" name="DSPS2" value="0x1" />
         <value caption="1:2^7" name="DSPS3" value="0x2" />
         <value caption="1:2^8" name="DSPS4" value="0x3" />
         <value caption="1:2^9" name="DSPS5" value="0x4" />
         <value caption="1:2^10" name="DSPS6" value="0x5" />
         <value caption="1:2^11" name="DSPS7" value="0x6" />
         <value caption="1:2^12" name="DSPS8" value="0x7" />
         <value caption="1:2^13" name="DSPS9" value="0x8" />
         <value caption="1:2^14" name="DSPS10" value="0x9" />
         <value caption="1:2^15" name="DSPS11" value="0xa" />
         <value caption="1:2^16" name="DSPS12" value="0xb" />
         <value caption="1:2^17" name="DSPS13" value="0xc" />
         <value caption="1:2^18" name="DSPS14" value="0xd" />
         <value caption="1:2^19" name="DSPS15" value="0xe" />
         <value caption="1:2^20" name="DSPS16" value="0xf" />
         <value caption="1:2^21" name="DSPS17" value="0x10" />
         <value caption="1:2^22" name="DSPS18" value="0x11" />
         <value caption="1:2^23" name="DSPS19" value="0x12" />
         <value caption="1:2^24" name="DSPS20" value="0x13" />
         <value caption="1:2^25" name="DSPS21" value="0x14" />
         <value caption="1:2^26" name="DSPS22" value="0x15" />
         <value caption="1:2^27" name="DSPS23" value="0x16" />
         <value caption="1:2^28" name="DSPS24" value="0x17" />
         <value caption="1:2^29" name="DSPS25" value="0x18" />
         <value caption="1:2^30" name="DSPS26" value="0x19" />
         <value caption="1:2^31" name="DSPS27" value="0x1a" />
         <value caption="1:2^32" name="DSPS28" value="0x1b" />
         <value caption="1:2^33" name="DSPS29" value="0x1c" />
         <value caption="1:2^34" name="DSPS30" value="0x1d" />
         <value caption="1:2^35" name="DSPS31" value="0x1e" />
         <value caption="1:2^36" name="DSPS32" value="0x1f" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Reference Clock Select bit" name="DEVCFG2__DSWDTOSC">
         <value caption="Select SOSC as DSWDT Reference Clock" name="SOSC" value="0x0" />
         <value caption="Select LPRC as DSWDT Reference clock" name="LPRC" value="0x1" />
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Enable bit" name="DEVCFG2__DSWDTEN">
         <value caption="Disable DSWDT during Deep Sleep Mode" name="OFF" value="0x0" />
         <value caption="Enable DSWDT during Deep Sleep Mode" name="ON" value="0x1" />
      </value-group>
