Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ2064DAH169.atdf
      <value-group caption="Error Code bits" name="SBT16ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Permission violation" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x1" />
         <value caption="No error" name="" value="0x0" />
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT16ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1" />
         <value caption="No multiple errors have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT0ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT1ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT2ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT3ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT4ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT5ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT6ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT7ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT8ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT9ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT10ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT11ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT12ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT13ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT14ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT15ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Requested Permissions Group bits" name="SBT16ELOG2__GROUP">
         <value caption="Group 3" name="" value="0x3" />
         <value caption="Group 2" name="" value="0x2" />
         <value caption="Group 1" name="" value="0x1" />
         <value caption="Group 0" name="" value="0x0" />
      </value-group>
