Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ2064DAH169.atdf
         <register caption="USB DMA Channel 1 Control Register" name="USBDMA1C" offset="0x204" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA1C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA1C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA1C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA1C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA1C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA1C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 1 Memory Address Register" name="USBDMA1A" offset="0x208" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 1 Count Register" name="USBDMA1N" offset="0x20c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 2 Control Register" name="USBDMA2C" offset="0x214" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA2C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA2C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA2C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA2C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA2C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA2C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 2 Memory Address Register" name="USBDMA2A" offset="0x218" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 2 Count Register" name="USBDMA2N" offset="0x21c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 3 Control Register" name="USBDMA3C" offset="0x224" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA3C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA3C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA3C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA3C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA3C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA3C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 3 Memory Address Register" name="USBDMA3A" offset="0x228" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 3 Count Register" name="USBDMA3N" offset="0x22c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 4 Control Register" name="USBDMA4C" offset="0x234" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA4C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA4C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA4C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA4C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA4C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA4C__DMABRSTM" />
         </register>
         <register caption="USB DMA Channel 4 Memory Address Register" name="USBDMA4A" offset="0x238" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMAADDR" />
         </register>
         <register caption="USB DMA Channel 4 Count Register" name="USBDMA4N" offset="0x23c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DMACOUNT" />
         </register>
         <register caption="USB DMA Channel 5 Control Register" name="USBDMA5C" offset="0x244" rw="RW" size="4">
            <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="USBDMA5C__DMAEN" />
            <bitfield caption="DMA Transfer Direction bit" mask="0x00000002" name="DMADIR" values="USBDMA5C__DMADIR" />
            <bitfield caption="DMA Transfer Mode bit" mask="0x00000004" name="DMAMODE" values="USBDMA5C__DMAMODE" />
            <bitfield caption="DMA Interrupt Enable bit" mask="0x00000008" name="DMAIE" values="USBDMA5C__DMAIE" />
            <bitfield mask="0x000000F0" name="DMAEP" />
            <bitfield caption="Bus Error bit" mask="0x00000100" name="DMAERR" values="USBDMA5C__DMAERR" />
            <bitfield caption="DMA Burst Mode Selection bit" mask="0x00000600" name="DMABRSTM" values="USBDMA5C__DMABRSTM" />
         </register>
